YL/app/controllers/posts_controller.rb

  def index
    @posts = Post.paginate(:page => params[:page],per_page: 3)
---
SELECT  "posts".* FROM "posts" LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "posts"

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "article", "author", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "background_image_file_name", "background_image_content_type", "background_image_file_size", "background_image_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "image_updated_at" = ?, "image_file_name" = ?, "background_image_updated_at" = ?, "background_image_file_name" = ?, "updated_at" = ? WHERE "posts"."id" = ?