app/controllers/books_controller.rb

   def index
    @books = Book.paginate(:page => params[:page],per_page: 3)
---
SELECT COUNT(*) FROM "books"