app/controllers/books_controller.rb

  def index
    @books = Book.all
---
SELECT  "books".* FROM "books" LIMIT 1 OFFSET 0

  def download
  @book= Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @book = Book.new(book_params)
    @book.document = params[:book][:document]
    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ""], ["created_at", "2016-05-05 15:47:29.955008"], ["updated_at", "2016-05-05 15:47:29.955008"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "name" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["name", "BEKH"], ["updated_at", "2016-05-05 16:00:56.560678"], ["id", 2]]