app/controllers/labs_controller.rb

SELECT "labs".* FROM "labs"
---
  def index
    @labs = Lab.all

INSERT INTO "labs" ("name", "meta", "info", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Lab"], ["meta", "Meta"], ["info", "Info"], ["created_at", "2016-05-07 00:05:56.516543"], ["updated_at", "2016-05-07 00:05:56.516543"]]
---
  def create
    @lab = Lab.new(lab_params)

    respond_to do |format|
      if @lab.save

UPDATE "labs" SET "meta" = ?, "updated_at" = ? WHERE "labs"."id" = ?
---
  def update
    respond_to do |format|
      if @lab.update(lab_params)

SELECT  "labs".* FROM "labs" WHERE "labs"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_lab
      @lab = Lab.find(params[:id])