app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
  def index
    @posts = Post.paginate(:page => params[:page],per_page: 3)

INSERT INTO "posts" ("title", "article", "author", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "background_image_file_name", "background_image_content_type", "background_image_file_size", "background_image_updated_at", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["image_file_name", "background-1134468_960_720.jpg"], ["image_file_size", 219137], ["image_updated_at", "2016-05-04 12:29:27.778998"], ["updated_at", "2016-05-04 12:29:28.199366"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 8]]
---
    def set_post
      @post = Post.friendly.find(params[:id])