app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Project"], ["description", "#<ActionDispatch::Http::UploadedFile:0x007f8348263c48>"], ["created_at", "2016-05-07 10:33:41.486886"], ["updated_at", "2016-05-07 10:33:41.486886"]]

  def update
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE "projects" SET "description" = ?, "view_file_name" = ?, "view_content_type" = ?, "view_file_size" = ?, "view_updated_at" = ?, "updated_at" = ? WHERE "projects"."id" = ?