app/controllers/welcome_controller.rb

	def about
		@users = User.all
---
SELECT "users".* FROM "users"